Tekla.Structures.Drawing.Polyline
The Polyline class defines a polyline that is a multipoint line. It can also have a bulge (curved lines).
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
Polyline MyPolyline;
PointList PolygonPoints = new PointList();
PolygonPoints.Add(new Point(10,10));
PolygonPoints.Add(new Point(50,10));
PolygonPoints.Add(new Point(50,50));
PolygonPoints.Add(new Point(10,50));
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
MyPolyline = new Polyline(views.Current as ViewBase, PolygonPoints);
MyPolyline.Insert();
}
}
}
}

Tekla.Structures.Drawing.Polyline.Points
The list of points for the polyline.

Tekla.Structures.Drawing.Polyline.Bulges
The list of individual bulges for the polygon.

Tekla.Structures.Drawing.Polyline.Bulge
The bulge (curve) to use for the polyline (a bulge is the ratio between the height and width of an object).

Tekla.Structures.Drawing.Polyline.Attributes
The attributes for the polyline.

Tekla.Structures.Drawing.Polyline.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Polyline.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList,Tekla.Structures.Drawing.Polyline.PolylineAttributes)
Creates a new polyline instance with the point list using the given attributes.
view: The view to be used.
pointList: The point list to be used.
attributes: The polyline attributes to be used.

Tekla.Structures.Drawing.Polyline.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList)
Creates a new polyline instance with the point list using standard attributes.
view: The view to be used.
pointList: The point list to be used.

Tekla.Structures.Drawing.Polyline.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Polyline.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Polyline.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.Polyline.Select
Calls the system to select and retrieve the object.
Returns: True on success.